#Задание1
#a=int(input("введите дату рождения"))
#if 1925<=a<=1944: print(" млчаливое поколение")
#if 1944<=a<=1967: print(" поколение бейби-бумеров")
#if 1967<=a<=1984: print("поколение x  ")
#if 1984<=a<=2000: print("поколение Y - меллиниалы")
#if 2000<=a<=2011: print("поколение z- зуммеры")
#if a>=2011: print(" поколение alfa")

#Задание 2
#a=int(input("введите первое число"))
#b=int(input("введите второе числе"))
#if a>b: a,b=b,a
#a1=a; a2=a
#num1=0 # сумма чисел кратных 3
#num2=0 # количество чисел кратных 3
#while a1<b:
#    if a%3==0:
#        num1=numt1+1
#        num2+=1
#    a1=1
#print("сумма чисел кратных 3",num1,"количество чисел кратных 3",num2,"сумма чисел кратныз 3")
#print("среднее арифметическое:", num1/num2)'''
#a=int(input("первое число"))
#b=int(input("второе число"))
#c=int(input("введите число в их диапозоне"))
#if a>b:a,b=b,a
#count1=0 # количество попыток
#import random
#d=random.randint(a,b)
#while d!=c:
#    print(c,d)
#    count1+=1
#if count1>20; print(count1)
#print(a,b,"загаданное число",d, "количество попыток угадать",count1,)'''
#Задание4
a=int(input("введите сторону квадрата"))
for i in range(j):
    for j in range(1,a,1):
        print(i*"*")


